InformationRegisters/НоменклатураПродаваемаяСовместно.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураПродаваемаяСовместно</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСлучаев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСлучаев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураПредпосылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаПредпосылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураСледствие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаСледствие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантАнализа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыАнализаНоменклатурыПродаваемойСовместно</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДобавленоАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НоменклатураПродаваемаяСовместно/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Элементы.ВыполнитьПоискАссоциаций.Видимость  = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НоменклатураПродаваемаяСовместно);
	Элементы.НастройкаПоискаАссоциаций.Видимость = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НоменклатураПродаваемаяСовместно);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ВариантДобавленияОтбор = Настройки.Получить("ВариантДобавленияОтбор");
	ВариантАнализаОтбор = Настройки.Получить("ВариантАнализаОтбор");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВариантАнализа", ВариантАнализаОтбор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ВариантАнализаОтбор));
	Если ВариантДобавленияОтбор = "" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДобавленоАвтоматически", Неопределено, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	ИначеЕсли ВариантДобавленияОтбор = "ДобавленоАвтоматически" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДобавленоАвтоматически", Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ИначеЕсли ВариантДобавленияОтбор = "ДобавленоВРучную" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДобавленоАвтоматически", Ложь, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настроить(Команда)
	
	ОткрытьФорму("РегистрСведений.НоменклатураПродаваемаяСовместно.Форма.НастройкаПоискаАссоциаций", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискАссоциаций(Команда)
	
	ОбновитьДанныеОНоменклатуреПродаваемойСовместно();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантДобавленияПриИзменении(Элемент)
	
	Если ВариантДобавленияОтбор = "" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДобавленоАвтоматически", Неопределено, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	ИначеЕсли ВариантДобавленияОтбор = "ДобавленоАвтоматически" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДобавленоАвтоматически", Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ИначеЕсли ВариантДобавленияОтбор = "ДобавленоВРучную" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДобавленоАвтоматически", Ложь, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантАнализаОтборПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВариантАнализа", ВариантАнализаОтбор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ВариантАнализаОтбор));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&НаСервере
Процедура ОбновитьДанныеОНоменклатуреПродаваемойСовместно()
	
	НоменклатураПродаваемаяСовместно.ОбновитьДанныеОНоменклатуреПродаваемойСовместно();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
